# Taps
tap "homebrew/cask"

# Packages (Formulae)
brew "awscli"
brew "bat"
brew "bitwarden-cli"
brew "duti"
brew "eza"
brew "fzf"
brew "git-delta"
brew "gh"
brew "jq"
brew "less"
brew "make"
brew "mas"
brew "node"
brew "python3"
brew "ripgrep"
brew "ruff"
brew "starship"
brew "stow"
brew "uv"
brew "wget"
brew "zinit"
brew "zoxide"

# Fonts
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"

# Apps (Casks)
cask "alt-tab"
cask "bettertouchtool"
cask "cursor"
cask "docker"
cask "firefox"
cask "google-chrome"
cask "itsycal"
cask "microsoft-outlook"
cask "microsoft-teams"
cask "notion"
cask "raycast"
cask "slack"
cask "spotify"
cask "warp"

# Mac App Store apps
mas "Hidden Bar", id: 1452453066
mas "Microsoft Outlook", id: 985367838
mas "Bitwarden", id: 1352778147 